**Условие задачи**

*Написать программу, которая из имеющегося массива строк формирует 
массив из строк, длина которых меньше либо равна 3 символа. 
Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. 
При решении не рекомендуется пользоваться коллекциями, лучше обойтись
исключительно массивами.*

***Принцип работы программы:***


1. Просим пользователя ввести 4 строки через консоль с помощью команды:

        Console.WriteLine();

2. Записываем каждую строку в отдельную переменную типа __*string*__ с помощью команды:

        Console.ReadLine();

3. Затем создаём строчный массив, состоящий из введенных пользователем строк. Для этого используем простейший метод __*CreateArrayFromStrings*__, который по-очереди записывает в элементы массива каждую строку.

4. После этого для удобства оценки работы программы выводим массив с заданными пользователем строками на экран с помощью метода **_PrintStringArray_**

5. Далее объявляем новый строчный массив __*intermediateArray*__. Это массив, который является результатом работы метода __*ChooseThreeOrLessSignString*__. 
- Метод проверяет, из скольки символов состоит каждый элемент массива, и заменяет элементы, состоящие более чем из 3х символов на знак "+".

6. Теперь нам нужно убрать из предыдущего массива все элементы, которые равны знаку "+" для того, чтобы вывести на экран итоговый массив, состоящий только из элементов, длина которых меньше или равна 3м символам. Для этого мы объявляем новый строчный массив __*resultArray*__, который будет результатом работы метода **_TrimStringArray_**.
- Данный метод сначала считает, сколько элементов со значением "+" содержится в переданном массиве, после чего создаём новый массив с количеством элементов, равному длине переданного массива минус количество элементов со значением "+". И в полученный новый массив записывает оставшиеся элементы (не равные "+") из переданного изначально массива.

7. И в конечном итоге выводим на экран итоговый массив, содержащий только элементы, длина которых составляет 3 или менее символов.

Работа двух основных методов этой программы __*ChooseThreeOrLessSignString*__ и **_TrimStringArray_** изображена в виде блок-схем. 

Скачать файл с этими блок-схемами можно из Google Drive по данной ссылке: 

https://drive.google.com/drive/folders/17xgyvVcL1Sf-cMN8gUfUso1IIlOEcHoa?usp=share_link 
